-- =============================================
-- BUILD IN FUNCTIONS                           
-- =============================================

-- -----------------------------------
-- 1. 문자열 관련 함수
-- -----------------------------------

-- ASCII(아스키 코드), CHAR(숫자)
SELECT ASCII('A'), CHAR(65);
SELECT ASCII('a'), CHAR(97);

-- BIT_LENGTH(문자열), CHAR_LENGTH(문자열), LENGTH(문자열)
-- 영어, 숫자, 특수기호 제하고 한 문자당 3바이트 할당
SELECT
		 BIT_LENGTH('한글')
	  , CHAR_LENGTH('한글')
	  , LENGTH('한글');

-- -----------------------------------
-- 2. 숫자 관련 함수
-- -----------------------------------




-- -----------------------------------
-- 3. 날짜 및 시간 관련 함수
-- -----------------------------------